/*************************************************************************
	> File Name: 182.c
	> Author: 
	> Mail: 
	> Created Time: 2019年08月02日 星期五 14时08分48秒
 ************************************************************************/

#include<stdio.h>

int main() {
    int n,i,t;
    int c[500000];
    scanf("%d", &n);
    for(i = 0; i < n; i++) {
        scanf("%d", &c[i]);
    }
    for(i = 0; i < n - 1; i++) { 
        if(c[i] > c[i + 1]) {
            t = c[i];
            c[i] = c[i + 1];
            c[i + 1] = t;
        }
    }
    printf("%d", c[n - 1]);
}
