/*************************************************************************
	> File Name: 442.c
	> Author: 
	> Mail: 
	> Created Time: 2019年08月12日 星期一 11时31分03秒
 ************************************************************************/

#include<stdio.h>
int f[31] = {0,1,2};

int main() {
    int n;
    scanf("%d", &n);
    for(int i = 1; i <= n; i++) {
        if(i != 1) printf(" ");
        if(i == 1) printf("1");
        if(i == 2) printf("2");
        if(i >= 3) {
            f[i] = f[i - 2] + f[i - 1];
            printf("%d", f[i]);
                   }
    }

}
